src/Catalogs/ОбъектыРазработки/ОбъектыРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыРазработки</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ТипОбъектаРазработки</name>
    <type>
      <types>EnumRef.ТипыОбъектовРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияВерсий</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВерсии</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ПрефиксВетки</name>
    <type>
      <types>CatalogRef.ПрефиксыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДорабатыватьКонфигурацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаGitLab</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.Спринты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиБазовой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьКрайнийСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolsWorld</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Aelita</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазовойЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияБазовойЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиИтилиум</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРелиза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаMergeRequest</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеФайлы</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КасаемыеПроцессы</name>
    <attributes>
      <name>Процесс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяПроцесса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>ИДКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спринты</name>
    <attributes>
      <name>Спринт</name>
      <type>
        <types>CatalogRef.Спринты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпринтРазработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФактическиеТрудозатраты</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатраченноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ОбъектыРазработки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокОбработок(Команда)
	
	Если Не ЗначениеЗаполнено(База) Тогда
		ВызватьИсключение НСтр("ru='Обновление возможно только по выбранной базе'", "ru");	
	КонецЕсли;
	ОбновитьСписокОбработокНаСервере();
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СобратьИзДевелопа(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Обработка = Элементы.Список.ТекущиеДанные.Ссылка;
	СобратьОбработкуНаСервере("develop", Обработка);

КонецПроцедуры

&НаКлиенте
Процедура СобратьИзМейна(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Обработка = Элементы.Список.ТекущиеДанные.Ссылка;
	СобратьОбработкуНаСервере("main", Обработка);

КонецПроцедуры

&НаКлиенте
Процедура СобратьОбработку(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Обработка = Элементы.Список.ТекущиеДанные.Ссылка;
	Задача = Элементы.СписокЗадач.ТекущиеДанные.Задача;
	
	СобратьОбработкуНаСервере(НомерЗадачи(Задача), Обработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокОбработокНаСервере()
	
	НастройкиБазы = РаботаСGitAPIПовтИсп.НастройкиБазы(База);
	Справочники.ОбъектыРазработки.СоздатьОбработкиПоРепозиторию(НастройкиБазы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ВывестиСписокЗадачПоОбработке", 0.2, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСписокЗадачПоОбработке() Экспорт
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ВывестиСписокЗадачПоОбработкеНаСервере(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСписокЗадачПоОбработкеНаСервере(Обработка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыРазработкиИсторияВерсий.Ссылка КАК Ссылка,
		|	ОбъектыРазработкиИсторияВерсий.Задача КАК Задача,
		|	МАКСИМУМ(ОбъектыРазработкиИсторияВерсий.ДатаВерсии) КАК ДатаВерсии,
		|	МАКСИМУМ(ОбъектыРазработкиИсторияВерсий.НомерВерсии) КАК НомерВерсии,
		|	ОбъектыРазработкиИсторияВерсий.Ответственный КАК Ответственный
		|ИЗ
		|	Справочник.ОбъектыРазработки.ИсторияВерсий КАК ОбъектыРазработкиИсторияВерсий
		|ГДЕ
		|	ОбъектыРазработкиИсторияВерсий.Ссылка = &Обработка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыРазработкиИсторияВерсий.Ссылка,
		|	ОбъектыРазработкиИсторияВерсий.Задача,
		|	ОбъектыРазработкиИсторияВерсий.Ответственный
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВерсии УБЫВ";
	
	Запрос.УстановитьПараметр("Обработка", Обработка);
	
	СписокЗадач.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура СобратьОбработкуНаСервере(ИмяВетки, Обработка)

	НастройкиПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(База.Владелец, "ПапкаАктуальныхОбработок, URLGitLab");
	РаботаСОбъектами.СкомпилироватьОбработкуПоВетке(ИмяВетки, Обработка, НастройкиПроекта, База);
	
КонецПроцедуры

&НаСервере
Функция НомерЗадачи(Задача)
	Возврат Справочники.Задачи.ВеткаЗадачи(Задача); 
КонецФункции

&НаКлиенте
Процедура ОткрытьПапку(Команда)
	
	НастройкиБазы = РаботаСGitAPIПовтИсп.НастройкиБазы(База);
	КаталогБилдаРепозитория = РаботаСGit.КаталогБилдаРепозитория(НастройкиБазы.КаталогБазыШара);
	Если КаталогБилдаРепозитория = "" Тогда
		ПоказатьПредупреждение(, "Не найден каталог обработок");
		Возврат;
	КонецЕсли;
	ЗапуститьПриложение(КаталогБилдаРепозитория);

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВVSCode(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Обработка = Элементы.Список.ТекущиеДанные.Ссылка;
	Данные = ПутьКОбработке(Обработка);
	КомандаСистемы(СтрШаблон("code %1 %2", Данные.КаталогБазы, Данные.ПутьКОбработке));
	
КонецПроцедуры

Функция ПутьКОбработке(Обработка)

	Результат = Новый Структура;
	НастройкиБазы = Справочники.Базы.НастройкиБазы(База);
	ПутьКОбработке = СтрШаблон("%1\src\epf\%2\Ext\ObjectModule.bsl", НастройкиБазы.КаталогБазы, Обработка.Наименование); //
	Результат.Вставить("ПутьКОбработке", ПутьКОбработке);
	Результат.Вставить("КаталогБазы", НастройкиБазы.КаталогБазы);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
